# SQL Homework

## Simple Select

In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%%sql sqlite:///foo1.db
CREATE TABLE parents AS
  SELECT "abraham" AS parent, "barack" AS child UNION
  SELECT "abraham",           "clinton"         UNION
  SELECT "delano",            "herbert"         UNION
  SELECT "fillmore",          "abraham"         UNION
  SELECT "fillmore",          "delano"          UNION
  SELECT "fillmore",          "grover"          UNION
  SELECT "eisenhower",        "fillmore";

(sqlite3.OperationalError) table parents already exists
[SQL: CREATE TABLE parents AS
  SELECT "abraham" AS parent, "barack" AS child UNION
  SELECT "abraham",           "clinton"         UNION
  SELECT "delano",            "herbert"         UNION
  SELECT "fillmore",          "abraham"         UNION
  SELECT "fillmore",          "delano"          UNION
  SELECT "fillmore",          "grover"          UNION
  SELECT "eisenhower",        "fillmore";]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

1. Select all records in the table

In [8]:
%%sql
select * from parents

 * sqlite:///foo1.db
Done.

[('abraham', 'barack'),
 ('abraham', 'clinton'),
 ('delano', 'herbert'),
 ('eisenhower', 'fillmore'),
 ('fillmore', 'abraham'),
 ('fillmore', 'delano'),
 ('fillmore', 'grover')]

2. SELECT child and parent, where abraham is the parent.

In [10]:
%%sql
select * from parents where parent='abraham'

 * sqlite:///foo1.db
Done.

[('abraham', 'barack'), ('abraham', 'clinton')]

3. Select all child that have e in their name

In [17]:
%%sql
SELECT child FROM parents 
where child like '%e%'

 * sqlite:///foo1.db
Done.

[('herbert',), ('fillmore',), ('delano',), ('grover',)]

4. Select all unique parents and order them by name

In [18]:
%%sql
select distinct parent 
from parents ORDER BY parent DESC

 * sqlite:///foo1.db
Done.

[('fillmore',), ('eisenhower',), ('delano',), ('abraham',)]

## Joins

Creating the table dogs

In [19]:
%%sql
CREATE TABLE dogs AS
  SELECT "abraham" AS name, "long" AS fur UNION
  SELECT "barack",          "short"       UNION
  SELECT "clinton",         "long"        UNION
  SELECT "delano",          "long"        UNION
  SELECT "eisenhower",      "short"       UNION
  SELECT "fillmore",        "curly"       UNION
  SELECT "grover",          "short"       UNION
  SELECT "herbert",         "curly";

 * sqlite:///foo1.db
Done.

[]

1. Count all the number of short haired dogs

In [20]:
%%sql
select count(*) from dogs where fur='short'

 * sqlite:///foo1.db
Done.

[(3,)]

2. Join the previous table and select the parent of the curly dogs

In [28]:
%%sql
create table parents_dogs as
SELECT *
FROM parents
INNER JOIN dogs ON dogs.name=parents.child;

 * sqlite:///foo1.db
Done.

[]

In [29]:
%%sql
select parent from parents_dogs
where fur='curly'

 * sqlite:///foo1.db
Done.

[('delano',), ('eisenhower',)]

3. Parents and children with the same fur type.

In [34]:
%%sql
select distinct parent, child from parents_dogs
group by fur

 * sqlite:///foo1.db
Done.

[('eisenhower', 'fillmore'), ('fillmore', 'delano'), ('fillmore', 'grover')]

## Aggregate

Creating the table:

In [30]:
%%sql
create table animals as
 select "dog" as kind, 4 as legs, 20 as weight union
 select "cat" , 4 , 10 union
 select "ferret" , 4 , 10 union
 select "parrot" , 2 , 6 union
 select "penguin" , 2 , 10 union
select "t-rex" , 2 , 12000;

 * sqlite:///foo1.db
Done.

[]

1.SELECT the animal with the minimum weight. Display kind and min_weight.

In [37]:
%%sql
SELECT kind, MIN(weight)
FROM animals

 * sqlite:///foo1.db
Done.

[('parrot', 6)]

2. Use aggregate function AVG to display a table with the average number of legs and the average weight.

In [39]:
%%sql
SELECT AVG(legs) as avg_legs, AVG(weight) as avg_weights
FROM animals

 * sqlite:///foo1.db
Done.

[(3.0, 2009.3333333333333)]

3. SELECT the animal kind(s) that have more than two legs, but weighs less than 20. Display kind, weight, legs.

In [40]:
%%sql
select kind, weight, legs
from animals
where legs>2 and weight<20

 * sqlite:///foo1.db
Done.

[('cat', 10, 4), ('ferret', 10, 4)]

4. SELECT the average weight for all the animals with 2 legs and the animals with 4 legs (by using GROUP BY).

In [43]:
%%sql
select AVG(weight) as avg_weight
from animals
group by legs

 * sqlite:///foo1.db
Done.

[(4005.3333333333335,), (13.333333333333334,)]